using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace LogTest
{
    public class LogConstants
    {
        public static string Msg = "ℹ 版本号：\"1.1.0\"\r\nℹ 开源地址：\"https://github.com/RayWangQvQ/BiliBiliTool\"\r\nℹ 当前环境：\"Development\" \r\n\r\nℹ -----开始每日任务-----\r\n\r\nℹ ---开始【\"登录\"】---\r\nℹ 登录成功，用户名: \"在*楼\"\r\nℹ 硬币余额: 666.5\r\nℹ 距离升级到Lv6还有: 258天\r\nℹ ---结束---\r\n\r\nℹ ---开始【\"观看、分享视频\"】---\r\nℹ 获取随机视频：\"【周深&李克勤】“勤深深”组合《突如其来的爱情》日语+粤语无缝切换天作之合！\"\r\nℹ 今天已经观看过了，不需要再看啦\r\nℹ 视频分享成功\r\nℹ ---结束---\r\n\r\nℹ ---开始【\"投币\"】---\r\nℹ 今日已投0枚硬币，目标是投5枚，还需再投5枚\r\nℹ 投币前余额为 : 666.5\r\nℹ 为“\"【本宫吐槽】变态赛高：传说中的神番《永生之酒》，究竟神在哪里？\"”投币成功\r\nℹ 为“\"鲲鹏计算引领多样性计算新时代【思维+】\"”投币成功\r\nℹ 为“\"【瞎看什么】激突！王者告诉你爸爸的爸爸叫什么！\"”投币成功\r\nℹ 为“\"带着18个妹子去广东吃吃吃，没想到却把她们苦哭了！\"”投币成功\r\nℹ 为“\"沙盘推演：红25军长征记（第一阶段）激战独树镇  徐海东血战庾家河  年龄最小的长征队伍\"”投币成功\r\nℹ 投币任务完成，余额为: 661.5\r\nℹ ---结束---\r\n\r\nℹ ---开始【\"漫画签到\"】---\r\nℹ 完成漫画签到\r\nℹ ---结束---\r\n\r\nℹ ---开始【\"直播中心签到\"】---\r\nℹ 直播签到成功，本次签到获得\"3000点用户经验,2根辣条\",\"\"\r\nℹ ---结束---\r\n\r\nℹ ---开始【\"直播中心银瓜子兑换硬币\"】---\r\nℹ 银瓜子兑换硬币失败，原因：\"银瓜子余额不足\"\r\nℹ 当前银瓜子余额: 564\r\nℹ ---结束---\r\n\r\nℹ ---开始【\"每月领取大会员福利\"】---\r\nℹ 目标领取日期为1号，今天是29号，跳过领取任务\r\nℹ ---结束---\r\n\r\nℹ ---开始【\"每月领取大会员漫画权益\"】---\r\nℹ 目标领取日期为1号，今天是29号，跳过领取任务\r\nℹ ---结束---\r\n\r\nℹ ---开始【\"每月为自己充电\"】---\r\nℹ 目标充电日期为31号，今天是29号，跳过充电任务\r\nℹ ---结束---\r\n\r\nℹ -----全部任务已执行结束-----\r\n\r\nℹ 开始推送\r\n";

        public static string Msg2 = $"1{Environment.NewLine}2{Environment.NewLine}{Environment.NewLine}3";
    }
}
